files/quick-and-dirty-pdf-reports-for-plain-text-accounting.tex
% Created 2020-02-12 Mi 18:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{libertine}
\usepackage{booktabs}
\date{\today}
\title{Financial Reports}
\begin{document}

\maketitle

\section{Balance sheet}
\label{sec:org4132055}
\begin{center}
\begin{tabular}{lr} \toprule
Assets   & \\ \midrule
Asset:Cash & 300.00 USD  \\
Asset:Bank & 25,336.71 USD  \\
Asset:Bank:JP Morgan & 22,651.48 USD  \\
Asset:Bank:Weels Fargo & 2,275.23 USD  \\
Asset:Bank:Wells Fargo & 410.00 USD  \\
Asset:Online Account & 125.21 USD  \\
Asset:Online Account:Apple Pay & 41.97 USD  \\
Asset:Online Account:Paypal & 83.24 USD  \\
Asset:Stocks & 26,900.00 USD  \\
Asset:Stocks:JP Morgan & 26,900.00 USD  \\ \midrule
Total: & 52,661.92 USD  \\ \midrule
Liabilities   & \\
Liabilities:Credit Card & 0.00 USD  \\
Liabilities:Credit Card:Visa Platinum & 0.00 USD  \\ \midrule
Total: & 0.00 USD  \\ \midrule
Net: & 52,661.92 USD  \\ \bottomrule
\end{tabular}
\end{center}

\section{Income statement}
\label{sec:org882796f}
\begin{center}
\begin{tabular}{lr} \toprule
Revenues   & \\ \midrule
Revenue:Capital Gain in stocks & 300.00 USD  \\
Revenue:Fx Revenue & 213.00 USD  \\
Revenue:Riding App & 300.00 USD  \\
Revenue:Salary & 21,600.00 USD  \\ \midrule
Total: & 22,413.00 USD  \\ \midrule
Expenses   & \\ \midrule
Expenses:Car:Gas & 78.37 USD  \\
Expenses:Clothing & -1,944.00 USD  \\
Expenses:Housing:Maintenance & -110.00 USD  \\
Expenses:Housing:Property Tax & 300.00 USD  \\
Expenses:Housing:Rental & 5,850.00 USD  \\
Expenses:Leisure:Events & 275.00 USD  \\
Expenses:Leisure:Travel & 2,678.00 USD  \\
Expenses:Products:Clothing & 80.00 USD  \\
Expenses:Products:Food & 1,148.33 USD  \\ \midrule
Total: & 8,355.70 USD  \\ \midrule
Net: & 14,057.30 USD  \\ \bottomrule
\end{tabular}
\end{center}
\end{document}
